Revit 2026 API

# ExportLayerInfoSetLayerModifiers Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLayerModifiers(
	IList<LayerModifier> layermodifiers
)
```
```vb
Public Sub SetLayerModifiers (
	layermodifiers As IList(Of LayerModifier)
)
```
```cpp
public:
void SetLayerModifiers(
	IList<LayerModifier^>^ layermodifiers
)
```
```fsharp
member SetLayerModifiers :
        layermodifiers : IList<LayerModifier> -> unit
```

#### Parameters

layermodifiers IListLayerModifier

#### Reference

ExportLayerInfo Class

Autodesk.Revit.DB Namespace